_posts/technology/2022-07-18-cppcoreguidelines-f54.html
---
layout: post
title: CppCoreGuidelines F.54 如果 lambda 会把 this 也捕获到，那最好写明捕获哪些变量
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;If you capture this, capture all variables explicitly (no default
capture)&rdquo;
</p>

<p>
理由：
</p>

<p>
违反此规则，会产生混乱不清的代码。在成员函数里用 <code>[=]</code> 捕获变量，看起来好像没问题。但是其实这种方式也会捕获到隐藏的 <code>this</code> 指针。而通过 <code>this</code> 指针是可以修改对象成员变量的。如果你通过 <code>this</code> 修改了对象成员变量，就相当于是进行了引用捕获。所以写代码的时候最好更明确一些。
</p>

<p>
例子：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">-*- compile-command: "g++ -std=c++20 code.cpp &amp;&amp; ./a"; -*-</span>
<span style="color: #7F0055; font-weight: bold;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #2A00FF;">iostream</span><span style="color: #707183;">&gt;</span>
<span style="color: #7F0055; font-weight: bold;">#include</span> <span style="color: #707183;">&lt;</span><span style="color: #2A00FF;">gsl/gsl</span><span style="color: #707183;">&gt;</span>
<span style="color: #7F0055; font-weight: bold;">using</span> <span style="color: #7F0055; font-weight: bold;">namespace</span> <span style="color: #110099;">std</span>;
<span style="color: #7F0055; font-weight: bold;">using</span> <span style="color: #7F0055; font-weight: bold;">namespace</span> <span style="color: #110099;">gsl</span>;
<span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">My_class</span> <span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">x</span> = 0;

    <span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">f</span><span style="color: #7388d6;">()</span>
    <span style="color: #7388d6;">{</span>
        <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span> = 0;
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>

        <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">lambda</span> = <span style="color: #909183;">[</span>=<span style="color: #909183;">]</span> <span style="color: #909183;">{</span> use<span style="color: #709870;">(</span>i, x<span style="color: #709870;">)</span>; <span style="color: #909183;">}</span>;
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">BAD: "looks like" copy/value capture</span>
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">[&amp;] has identical semantics and copies the this pointer</span>
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">under the current rules</span>
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">[=,this] and [&amp;,this] are not much better, and confusing</span>

        x = 42;
        lambda<span style="color: #909183;">()</span>; <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">calls use(0, 42);</span>
        x = 43;
        lambda<span style="color: #909183;">()</span>; <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">calls use(0, 43);</span>

        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>

        <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">lambda2</span> = <span style="color: #909183;">[</span><span style="color: #110099;">i</span>, <span style="color: #7F0055; font-weight: bold;">this</span><span style="color: #909183;">]</span> <span style="color: #909183;">{</span> use<span style="color: #709870;">(</span>i, x<span style="color: #709870;">)</span>; <span style="color: #909183;">}</span>;
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">ok, most explicit and least confusing</span>

        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>;
</pre>
</div>


<p>
注意：
</p>

<p>
这个话题在 C++ 标准会议中讨论很剧烈。未来可能设计一个新的捕获机制，或者调整 <code>[=]</code> 捕获的意义（比如， <code>[=]</code> 捕获不再捕获到 <code>this</code> 指针。
</p>


<p>
强化：
</p>

<p>
如果 <code>lambda</code> 用了默认捕获，且可能会捕获到 <code>this</code> 指针。给代码打上一个警告标记。
</p>
